Terraform plan for __ibo__
<details>
<summary>Plan: 4 to add, 1 to change, 1 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # google_compute_firewall.istio_rule will be updated in-place
  ~ resource "google_compute_firewall" "istio_rule" {
        id                      = "projects/ibo-prod/global/firewalls/ebo-prod-gke-cluster-istio-allow-firewall"
        name                    = "ebo-prod-gke-cluster-istio-allow-firewall"
      ~ target_tags             = [
          - "gke-ebo-prod-gke-cluster-87c79679-node",
          + "gke-ebo-prod-gke-cluster-89b20f1f-node",
        ]
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_storage_bucket.customer_file_bucket will be created
  + resource "google_storage_bucket" "customer_file_bucket" {
      + bucket_policy_only          = (known after apply)
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "ASIA"
      + name                        = "customer-support-files-production"
      + project                     = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)
    }

  # google_storage_bucket.invoice_file_bucket will be created
  + resource "google_storage_bucket" "invoice_file_bucket" {
      + bucket_policy_only          = (known after apply)
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "ASIA"
      + name                        = "invoice-file-upload-production"
      + project                     = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)
    }

  # google_storage_bucket_iam_member.customer_service_account_iam will be created
  + resource "google_storage_bucket_iam_member" "customer_service_account_iam" {
      + bucket = "customer-support-files-production"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:customer-support-files@ibo-prod.iam.gserviceaccount.com"
      + role   = "roles/storage.admin"
    }

  # google_storage_bucket_iam_member.invoice_service_account_iam will be created
  + resource "google_storage_bucket_iam_member" "invoice_service_account_iam" {
      + bucket = "invoice-file-upload-production"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:invoice-file-upload@ibo-prod.iam.gserviceaccount.com"
      + role   = "roles/storage.admin"
    }

  # module.jumpbox.kubernetes_deployment.jumpbox_deployment will be destroyed
  - resource "kubernetes_deployment" "jumpbox_deployment" {
      - id               = "default/jumpbox" -> null
      - wait_for_rollout = true -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 1 -> null
          - labels           = {} -> null
          - name             = "jumpbox" -> null
          - namespace        = "default" -> null
          - resource_version = "15173" -> null
          - uid              = "0ca7e130-6eff-4f3b-b582-6d0f5b8c9cbc" -> null
        }

      - spec {
          - min_ready_seconds         = 0 -> null
          - paused                    = false -> null
          - progress_deadline_seconds = 600 -> null
          - replicas                  = "1" -> null
          - revision_history_limit    = 10 -> null

          - selector {
              - match_labels = {
                  - "name" = "jumpbox"
                } -> null
            }

          - strategy {
              - type = "RollingUpdate" -> null

              - rolling_update {
                  - max_surge       = "25%" -> null
                  - max_unavailable = "25%" -> null
                }
            }

          - template {
              - metadata {
                  - annotations = {} -> null
                  - generation  = 0 -> null
                  - labels      = {
                      - "name" = "jumpbox"
                    } -> null
                }

              - spec {
                  - active_deadline_seconds          = 0 -> null
                  - automount_service_account_token  = true -> null
                  - dns_policy                       = "ClusterFirst" -> null
                  - enable_service_links             = true -> null
                  - host_ipc                         = false -> null
                  - host_network                     = false -> null
                  - host_pid                         = false -> null
                  - node_selector                    = {} -> null
                  - restart_policy                   = "Always" -> null
                  - share_process_namespace          = false -> null
                  - termination_grace_period_seconds = 30 -> null

                  - container {
                      - args                       = [] -> null
                      - command                    = [
                          - "sleep",
                          - "infinity",
                        ] -> null
                      - image                      = "us.gcr.io/ebo-dev-321910/jumpbox@sha256:8a79d9f2acdf9451591ecc27c7dc5b4531751f437a5905f3edaf302b5f6337da" -> null
                      - image_pull_policy          = "Always" -> null
                      - name                       = "jumpbox" -> null
                      - stdin                      = false -> null
                      - stdin_once                 = false -> null
                      - termination_message_path   = "/dev/termination-log" -> null
                      - termination_message_policy = "File" -> null
                      - tty                        = false -> null

                      - resources {}
                    }

                  - image_pull_secrets {
                      - name = "gcr-json-key-jumpbox" -> null
                    }
                }
            }
        }
    }

Plan: 4 to add, 1 to change, 1 to destroy.
```
</details>

Plan generated in [Terraform #301](https://github.com/ebomart/commerce-infrastructure/actions/runs/1402394882)